/*++

    (c) S-Patriarch, 2023

--*/

#ifndef __CHAT_USINGDB_H__
#define __CHAT_USINGDB_H__

#include "../include/sct.h"
#include "../include/funct.h"

#include "ptl/pexcept.h"

#include "/usr/include/mysql/mysql.h"

#include <iostream>
#include <string>
#include <vector>

////////////////////////////////////////////////////////////////////////////////
namespace chat {

//------------------------------------------------------------------------------
// Функция проверяет существование базы данных.
//
bool
db_existence_check();

//------------------------------------------------------------------------------
// Функция создает базу данных и все необходимые таблицы с их зависимостями.
//
void
db_create();

//------------------------------------------------------------------------------
// Авторизация клиента.
//
bool
db_authorization(std::vector<std::string>&, Exchange&);

//------------------------------------------------------------------------------
// Регистрация клиента.
//
bool
db_registration(std::vector<std::string>&, Exchange&);

//------------------------------------------------------------------------------
// Удаление клиента.
//
bool
db_delete(std::vector<std::string>&);

//------------------------------------------------------------------------------
// Редактирование данных клиента.
//
bool
db_edit(std::vector<std::string>&);

//------------------------------------------------------------------------------
// Предоставление не прочитанных сообщений клиента.
//
bool
db_message_from_database(std::vector<std::string>&, Exchange&);

//------------------------------------------------------------------------------
// Запись направленного сообщения клиента.
//
bool
db_message_to_database(std::vector<std::string>&);

//------------------------------------------------------------------------------
// Установление статуса сообщений клиента.
//
bool
db_message_status(std::vector<std::string>&);

} // namespace chat

#endif // __CHAT_USINGDB_H__
