/*++

    (c) S-Patriarch, 2023
    Реализация функций информационного механизма чата.

--*/

#include "../include/info.h"

////////////////////////////////////////////////////////////////////////////////
namespace chat {

//------------------------------------------------------------------------------
void
get_logo(std::uint16_t proSwitch)
{
    if (proSwitch == 1000) {
        std::cout << "tchat 7.1 SERVER\n";
    }
    else if (proSwitch == 1001) {
        std::cout << "tchat 7.1 CLIENT\n";
    }

    struct utsname sysinfo;
    uname(&sysinfo);

    std::cout 
        << "- "
        << sysinfo.sysname
        << '\n'
        << "- "
        << sysinfo.version
        << "\n\n";
}

//------------------------------------------------------------------------------
void
get_info()
{
    std::cout 
        << "Использование:\n"
           "  к: <кому сообщение> или [параметр]\n"
           "  ч: <сообщение>\n";
}

//------------------------------------------------------------------------------
void
get_help()
{
    std::cout 
        << "Параметры:\n"
           "  -h, -? вызов информации о параметрах чата\n"
           //"  -e     редактировать данные пользователя\n"
           //"  -d     удалить пользователя\n"
           "  -q     завершить работу чата\n";
}

} // namespace chat
