/*++

    (c) S-Patriarch, 2023
    Реализация функций информационного механизма чата.

--*/

#include "../include/info.h"

////////////////////////////////////////////////////////////////////////////////
namespace chat
{
//------------------------------------------------------------------------------
void
get_logo(std::uint16_t proSwitch)
{
    if (proSwitch == 1000) {
        std::cout << "tchat 7.0 SERVER\n";
    }
    else if (proSwitch == 1001) {
        std::cout << "tchat 7.0 CLIENT\n";
    }

    struct utsname sysinfo;
    uname(&sysinfo);

    std::cout << "- "
              << sysinfo.sysname
              << '\n'
              << "- "
              << sysinfo.version
              << "\n\n";
}

//------------------------------------------------------------------------------
void
get_info()
{
    std::cout << "Using:\n"
                 "  msg: [сообщение для пользователя]\n\n";
}

//------------------------------------------------------------------------------
void
get_help()
{
    std::cout << "tchat 7.0\n"
                 "Using: к: [имя пользователя] или [параметр]\n"
                 "       ч: [сообщение для пользователя] или [параметр]\n"
                 "Parameters: -h, -? вызов информации о параметрах чата\n"
                 "            -e     редактировать данные пользователя чата\n"
                 "            -q     завершить работу чата\n\n";
                 //" --all  сообщение для всех пользователей чата\n\n";
}

} // namespace chat
