/*++

    (c) S-Patriarch, 2023
    Определение функций, реализующих информационный механизм чата.

--*/

#ifndef __CHAT_INFO_H__
#define __CHAT_INFO_H__

#include <cstdint>
#include <iostream>
#include <sys/utsname.h>

////////////////////////////////////////////////////////////////////////////////
namespace chat {

//------------------------------------------------------------------------------
// Функция выводит информацию при начальной загрузки чата.
//
void
get_logo(std::uint16_t);

//------------------------------------------------------------------------------
// Функция выводит информацию чата.
//
void
get_info();

//------------------------------------------------------------------------------
// Функция выводит информацию о чате и управляющих
// параметрах работы чата.
//
void
get_help();

} // namespace chat

#endif // __CHAT_INFO_H__
